GopalSaraf/Practicals/PSDL/include/proc/pic12lf1612.inc
// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 041Ch
// bitfield definitions
T6CON_OUTPS_POSN                         equ 0000h
T6CON_OUTPS_POSITION                     equ 0000h
T6CON_OUTPS_SIZE                         equ 0004h
T6CON_OUTPS_LENGTH                       equ 0004h
T6CON_OUTPS_MASK                         equ 000Fh
T6CON_CKPS_POSN                          equ 0004h
T6CON_CKPS_POSITION                      equ 0004h
T6CON_CKPS_SIZE                          equ 0003h
T6CON_CKPS_LENGTH                        equ 0003h
T6CON_CKPS_MASK                          equ 0070h
T6CON_ON_POSN                            equ 0007h
T6CON_ON_POSITION                        equ 0007h
T6CON_ON_SIZE                            equ 0001h
T6CON_ON_LENGTH                          equ 0001h
T6CON_ON_MASK                            equ 0080h
T6CON_T6OUTPS_POSN                       equ 0000h
T6CON_T6OUTPS_POSITION                   equ 0000h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 000Fh
T6CON_T6CKPS_POSN                        equ 0004h
T6CON_T6CKPS_POSITION                    equ 0004h
T6CON_T6CKPS_SIZE                        equ 0003h
T6CON_T6CKPS_LENGTH                      equ 0003h
T6CON_T6CKPS_MASK                        equ 0070h
T6CON_T6ON_POSN                          equ 0007h
T6CON_T6ON_POSITION                      equ 0007h
T6CON_T6ON_SIZE                          equ 0001h
T6CON_T6ON_LENGTH                        equ 0001h
T6CON_T6ON_MASK                          equ 0080h
T6CON_T6OUTPS0_POSN                      equ 0000h
T6CON_T6OUTPS0_POSITION                  equ 0000h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0001h
T6CON_T6OUTPS1_POSN                      equ 0001h
T6CON_T6OUTPS1_POSITION                  equ 0001h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0002h
T6CON_T6OUTPS2_POSN                      equ 0002h
T6CON_T6OUTPS2_POSITION                  equ 0002h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0004h
T6CON_T6OUTPS3_POSN                      equ 0003h
T6CON_T6OUTPS3_POSITION                  equ 0003h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0008h
T6CON_T6CKPS0_POSN                       equ 0004h
T6CON_T6CKPS0_POSITION                   equ 0004h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0010h
T6CON_T6CKPS1_POSN                       equ 0005h
T6CON_T6CKPS1_POSITION                   equ 0005h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0020h
T6CON_T6CKPS2_POSN                       equ 0006h
T6CON_T6CKPS2_POSITION                   equ 0006h
T6CON_T6CKPS2_SIZE                       equ 0001h
T6CON_T6CKPS2_LENGTH                     equ 0001h
T6CON_T6CKPS2_MASK                       equ 0040h
T6CON_OUTPS0_POSN                        equ 0000h
T6CON_OUTPS0_POSITION                    equ 0000h
T6CON_OUTPS0_SIZE                        equ 0001h
T6CON_OUTPS0_LENGTH                      equ 0001h
T6CON_OUTPS0_MASK                        equ 0001h
T6CON_OUTPS1_POSN                        equ 0001h
T6CON_OUTPS1_POSITION                    equ 0001h
T6CON_OUTPS1_SIZE                        equ 0001h
T6CON_OUTPS1_LENGTH                      equ 0001h
T6CON_OUTPS1_MASK                        equ 0002h
T6CON_OUTPS2_POSN                        equ 0002h
T6CON_OUTPS2_POSITION                    equ 0002h
T6CON_OUTPS2_SIZE                        equ 0001h
T6CON_OUTPS2_LENGTH                      equ 0001h
T6CON_OUTPS2_MASK                        equ 0004h
T6CON_OUTPS3_POSN                        equ 0003h
T6CON_OUTPS3_POSITION                    equ 0003h
T6CON_OUTPS3_SIZE                        equ 0001h
T6CON_OUTPS3_LENGTH                      equ 0001h
T6CON_OUTPS3_MASK                        equ 0008h
T6CON_CKPS0_POSN                         equ 0004h
T6CON_CKPS0_POSITION                     equ 0004h
T6CON_CKPS0_SIZE                         equ 0001h
T6CON_CKPS0_LENGTH                       equ 0001h
T6CON_CKPS0_MASK                         equ 0010h
T6CON_CKPS1_POSN                         equ 0005h
T6CON_CKPS1_POSITION                     equ 0005h
T6CON_CKPS1_SIZE                         equ 0001h
T6CON_CKPS1_LENGTH                       equ 0001h
T6CON_CKPS1_MASK                         equ 0020h
T6CON_CKPS2_POSN                         equ 0006h
T6CON_CKPS2_POSITION                     equ 0006h
T6CON_CKPS2_SIZE                         equ 0001h
T6CON_CKPS2_LENGTH                       equ 0001h
T6CON_CKPS2_MASK                         equ 0040h
T6CON_TMR6ON_POSN                        equ 0007h
T6CON_TMR6ON_POSITION                    equ 0007h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0080h

// Register: T6HLT
#define T6HLT T6HLT
T6HLT                                    equ 041Dh
// bitfield definitions
T6HLT_MODE_POSN                          equ 0000h
T6HLT_MODE_POSITION                      equ 0000h
T6HLT_MODE_SIZE                          equ 0004h
T6HLT_MODE_LENGTH                        equ 0004h
T6HLT_MODE_MASK                          equ 000Fh
T6HLT_CKSYNC_POSN                        equ 0005h
T6HLT_CKSYNC_POSITION                    equ 0005h
T6HLT_CKSYNC_SIZE                        equ 0001h
T6HLT_CKSYNC_LENGTH                      equ 0001h
T6HLT_CKSYNC_MASK                        equ 0020h
T6HLT_CKPOL_POSN                         equ 0006h
T6HLT_CKPOL_POSITION                     equ 0006h
T6HLT_CKPOL_SIZE                         equ 0001h
T6HLT_CKPOL_LENGTH                       equ 0001h
T6HLT_CKPOL_MASK                         equ 0040h
T6HLT_PSYNC_POSN                         equ 0007h
T6HLT_PSYNC_POSITION                     equ 0007h
T6HLT_PSYNC_SIZE                         equ 0001h
T6HLT_PSYNC_LENGTH                       equ 0001h
T6HLT_PSYNC_MASK                         equ 0080h
T6HLT_MODE0_POSN                         equ 0000h
T6HLT_MODE0_POSITION                     equ 0000h
T6HLT_MODE0_SIZE                         equ 0001h
T6HLT_MODE0_LENGTH                       equ 0001h
T6HLT_MODE0_MASK                         equ 0001h
T6HLT_MODE1_POSN                         equ 0001h
T6HLT_MODE1_POSITION                     equ 0001h
T6HLT_MODE1_SIZE                         equ 0001h
T6HLT_MODE1_LENGTH                       equ 0001h
T6HLT_MODE1_MASK                         equ 0002h
T6HLT_MODE2_POSN                         equ 0002h
T6HLT_MODE2_POSITION                     equ 0002h
T6HLT_MODE2_SIZE                         equ 0001h
T6HLT_MODE2_LENGTH                       equ 0001h
T6HLT_MODE2_MASK                         equ 0004h
T6HLT_MODE3_POSN                         equ 0003h
T6HLT_MODE3_POSITION                     equ 0003h
T6HLT_MODE3_SIZE                         equ 0001h
T6HLT_MODE3_LENGTH                       equ 0001h
T6HLT_MODE3_MASK                         equ 0008h
T6HLT_T6MODE_POSN                        equ 0000h
T6HLT_T6MODE_POSITION                    equ 0000h
T6HLT_T6MODE_SIZE                        equ 0004h
T6HLT_T6MODE_LENGTH                      equ 0004h
T6HLT_T6MODE_MASK                        equ 000Fh
T6HLT_T6CKSYNC_POSN                      equ 0005h
T6HLT_T6CKSYNC_POSITION                  equ 0005h
T6HLT_T6CKSYNC_SIZE                      equ 0001h
T6HLT_T6CKSYNC_LENGTH                    equ 0001h
T6HLT_T6CKSYNC_MASK                      equ 0020h
T6HLT_T6CKPOL_POSN                       equ 0006h
T6HLT_T6CKPOL_POSITION                   equ 0006h
T6HLT_T6CKPOL_SIZE                       equ 0001h
T6HLT_T6CKPOL_LENGTH                     equ 0001h
T6HLT_T6CKPOL_MASK                       equ 0040h
T6HLT_T6PSYNC_POSN                       equ 0007h
T6HLT_T6PSYNC_POSITION                   equ 0007h
T6HLT_T6PSYNC_SIZE                       equ 0001h
T6HLT_T6PSYNC_LENGTH                     equ 0001h
T6HLT_T6PSYNC_MASK                       equ 0080h
T6HLT_T6MODE0_POSN                       equ 0000h
T6HLT_T6MODE0_POSITION                   equ 0000h
T6HLT_T6MODE0_SIZE                       equ 0001h
T6HLT_T6MODE0_LENGTH                     equ 0001h
T6HLT_T6MODE0_MASK                       equ 0001h
T6HLT_T6MODE1_POSN                       equ 0001h
T6HLT_T6MODE1_POSITION                   equ 0001h
T6HLT_T6MODE1_SIZE                       equ 0001h
T6HLT_T6MODE1_LENGTH                     equ 0001h
T6HLT_T6MODE1_MASK                       equ 0002h
T6HLT_T6MODE2_POSN                       equ 0002h
T6HLT_T6MODE2_POSITION                   equ 0002h
T6HLT_T6MODE2_SIZE                       equ 0001h
T6HLT_T6MODE2_LENGTH                     equ 0001h
T6HLT_T6MODE2_MASK                       equ 0004h
T6HLT_T6MODE3_POSN                       equ 0003h
T6HLT_T6MODE3_POSITION                   equ 0003h
T6HLT_T6MODE3_SIZE                       equ 0001h
T6HLT_T6MODE3_LENGTH                     equ 0001h
T6HLT_T6MODE3_MASK                       equ 0008h

// Register: T6CLKCON
#define T6CLKCON T6CLKCON
T6CLKCON                                 equ 041Eh
// bitfield definitions
T6CLKCON_T6CS_POSN                       equ 0000h
T6CLKCON_T6CS_POSITION                   equ 0000h
T6CLKCON_T6CS_SIZE                       equ 0003h
T6CLKCON_T6CS_LENGTH                     equ 0003h
T6CLKCON_T6CS_MASK                       equ 0007h
T6CLKCON_T6CS0_POSN                      equ 0000h
T6CLKCON_T6CS0_POSITION                  equ 0000h
T6CLKCON_T6CS0_SIZE                      equ 0001h
T6CLKCON_T6CS0_LENGTH                    equ 0001h
T6CLKCON_T6CS0_MASK                      equ 0001h
T6CLKCON_T6CS1_POSN                      equ 0001h
T6CLKCON_T6CS1_POSITION                  equ 0001h
T6CLKCON_T6CS1_SIZE                      equ 0001h
T6CLKCON_T6CS1_LENGTH                    equ 0001h
T6CLKCON_T6CS1_MASK                      equ 0002h
T6CLKCON_T6CS2_POSN                      equ 0002h
T6CLKCON_T6CS2_POSITION                  equ 0002h
T6CLKCON_T6CS2_SIZE                      equ 0001h
T6CLKCON_T6CS2_LENGTH                    equ 0001h
T6CLKCON_T6CS2_MASK                      equ 0004h

// Register: T6RST
#define T6RST T6RST
T6RST                                    equ 041Fh
// bitfield definitions
T6RST_RSEL_POSN                          equ 0000h
T6RST_RSEL_POSITION                      equ 0000h
T6RST_RSEL_SIZE                          equ 0004h
T6RST_RSEL_LENGTH                        equ 0004h
T6RST_RSEL_MASK                          equ 000Fh
T6RST_RSEL0_POSN                         equ 0000h
T6RST_RSEL0_POSITION                     equ 0000h
T6RST_RSEL0_SIZE                         equ 0001h
T6RST_RSEL0_LENGTH                       equ 0001h
T6RST_RSEL0_MASK                         equ 0001h
T6RST_RSEL1_POSN                         equ 0001h
T6RST_RSEL1_POSITION                     equ 0001h
T6RST_RSEL1_SIZE                         equ 0001h
T6RST_RSEL1_LENGTH                       equ 0001h
T6RST_RSEL1_MASK                         equ 0002h
T6RST_RSEL2_POSN                         equ 0002h
T6RST_RSEL2_POSITION                     equ 0002h
T6RST_RSEL2_SIZE                         equ 0001h
T6RST_RSEL2_LENGTH                       equ 0001h
T6RST_RSEL2_MASK                         equ 0004h
T6RST_RSEL3_POSN                         equ 0003h
T6RST_RSEL3_POSITION                     equ 0003h
T6RST_RSEL3_SIZE                         equ 0001h
T6RST_RSEL3_LENGTH                       equ 0001h
T6RST_RSEL3_MASK                         equ 0008h
T6RST_T6RSEL_POSN                        equ 0000h
T6RST_T6RSEL_POSITION                    equ 0000h
T6RST_T6RSEL_SIZE                        equ 0004h
T6RST_T6RSEL_LENGTH                      equ 0004h
T6RST_T6RSEL_MASK                        equ 000Fh
T6RST_T6RSEL0_POSN                       equ 0000h
T6RST_T6RSEL0_POSITION                   equ 0000h
T6RST_T6RSEL0_SIZE                       equ 0001h
T6RST_T6RSEL0_LENGTH                     equ 0001h
T6RST_T6RSEL0_MASK                       equ 0001h
T6RST_T6RSEL1_POSN                       equ 0001h
T6RST_T6RSEL1_POSITION                   equ 0001h
T6RST_T6RSEL1_SIZE                       equ 0001h
T6RST_T6RSEL1_LENGTH                     equ 0001h
T6RST_T6RSEL1_MASK                       equ 0002h
T6RST_T6RSEL2_POSN                       equ 0002h
T6RST_T6RSEL2_POSITION                   equ 0002h
T6RST_T6RSEL2_SIZE                       equ 0001h
T6RST_T6RSEL2_LENGTH                     equ 0001h
T6RST_T6RSEL2_MASK                       equ 0004h
T6RST_T6RSEL3_POSN                       equ 0003h
T6RST_T6RSEL3_POSITION                   equ 0003h
T6RST_T6RSEL3_SIZE                       equ 0001h
T6RST_T6RSEL3_LENGTH                     equ 0001h
T6RST_T6RSEL3_MASK                       equ 0008h

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
CWG1DBR                                  equ 0691h
// bitfield definitions
CWG1DBR_DBR_POSN                         equ 0000h
CWG1DBR_DBR_POSITION                     equ 0000h
CWG1DBR_DBR_SIZE                         equ 0006h
CWG1DBR_DBR_LENGTH                       equ 0006h
CWG1DBR_DBR_MASK                         equ 003Fh
CWG1DBR_DBR0_POSN                        equ 0000h
CWG1DBR_DBR0_POSITION                    equ 0000h
CWG1DBR_DBR0_SIZE                        equ 0001h
CWG1DBR_DBR0_LENGTH                      equ 0001h
CWG1DBR_DBR0_MASK                        equ 0001h
CWG1DBR_DBR1_POSN                        equ 0001h
CWG1DBR_DBR1_POSITION                    equ 0001h
CWG1DBR_DBR1_SIZE                        equ 0001h
CWG1DBR_DBR1_LENGTH                      equ 0001h
CWG1DBR_DBR1_MASK                        equ 0002h
CWG1DBR_DBR2_POSN                        equ 0002h
CWG1DBR_DBR2_POSITION                    equ 0002h
CWG1DBR_DBR2_SIZE                        equ 0001h
CWG1DBR_DBR2_LENGTH                      equ 0001h
CWG1DBR_DBR2_MASK                        equ 0004h
CWG1DBR_DBR3_POSN                        equ 0003h
CWG1DBR_DBR3_POSITION                    equ 0003h
CWG1DBR_DBR3_SIZE                        equ 0001h
CWG1DBR_DBR3_LENGTH                      equ 0001h
CWG1DBR_DBR3_MASK                        equ 0008h
CWG1DBR_DBR4_POSN                        equ 0004h
CWG1DBR_DBR4_POSITION                    equ 0004h
CWG1DBR_DBR4_SIZE                        equ 0001h
CWG1DBR_DBR4_LENGTH                      equ 0001h
CWG1DBR_DBR4_MASK                        equ 0010h
CWG1DBR_DBR5_POSN                        equ 0005h
CWG1DBR_DBR5_POSITION                    equ 0005h
CWG1DBR_DBR5_SIZE                        equ 0001h
CWG1DBR_DBR5_LENGTH                      equ 0001h
CWG1DBR_DBR5_MASK                        equ 0020h
CWG1DBR_CWG1DBR_POSN                     equ 0000h
CWG1DBR_CWG1DBR_POSITION                 equ 0000h
CWG1DBR_CWG1DBR_SIZE                     equ 0006h
CWG1DBR_CWG1DBR_LENGTH                   equ 0006h
CWG1DBR_CWG1DBR_MASK                     equ 003Fh
CWG1DBR_CWG1DBR0_POSN                    equ 0000h
CWG1DBR_CWG1DBR0_POSITION                equ 0000h
CWG1DBR_CWG1DBR0_SIZE                    equ 0001h
CWG1DBR_CWG1DBR0_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR0_MASK                    equ 0001h
CWG1DBR_CWG1DBR1_POSN                    equ 0001h
CWG1DBR_CWG1DBR1_POSITION                equ 0001h
CWG1DBR_CWG1DBR1_SIZE                    equ 0001h
CWG1DBR_CWG1DBR1_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR1_MASK                    equ 0002h
CWG1DBR_CWG1DBR2_POSN                    equ 0002h
CWG1DBR_CWG1DBR2_POSITION                equ 0002h
CWG1DBR_CWG1DBR2_SIZE                    equ 0001h
CWG1DBR_CWG1DBR2_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR2_MASK                    equ 0004h
CWG1DBR_CWG1DBR3_POSN                    equ 0003h
CWG1DBR_CWG1DBR3_POSITION                equ 0003h
CWG1DBR_CWG1DBR3_SIZE                    equ 0001h
CWG1DBR_CWG1DBR3_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR3_MASK                    equ 0008h
CWG1DBR_CWG1DBR4_POSN                    equ 0004h
CWG1DBR_CWG1DBR4_POSITION                equ 0004h
CWG1DBR_CWG1DBR4_SIZE                    equ 0001h
CWG1DBR_CWG1DBR4_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR4_MASK                    equ 0010h
CWG1DBR_CWG1DBR5_POSN                    equ 0005h
CWG1DBR_CWG1DBR5_POSITION                equ 0005h
CWG1DBR_CWG1DBR5_SIZE                    equ 0001h
CWG1DBR_CWG1DBR5_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR5_MASK                    equ 0020h

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
CWG1DBF                                  equ 0692h
// bitfield definitions
CWG1DBF_DBF_POSN                         equ 0000h
CWG1DBF_DBF_POSITION                     equ 0000h
CWG1DBF_DBF_SIZE                         equ 0006h
CWG1DBF_DBF_LENGTH                       equ 0006h
CWG1DBF_DBF_MASK                         equ 003Fh
CWG1DBF_DBF0_POSN                        equ 0000h
CWG1DBF_DBF0_POSITION                    equ 0000h
CWG1DBF_DBF0_SIZE                        equ 0001h
CWG1DBF_DBF0_LENGTH                      equ 0001h
CWG1DBF_DBF0_MASK                        equ 0001h
CWG1DBF_DBF1_POSN                        equ 0001h
CWG1DBF_DBF1_POSITION                    equ 0001h
CWG1DBF_DBF1_SIZE                        equ 0001h
CWG1DBF_DBF1_LENGTH                      equ 0001h
CWG1DBF_DBF1_MASK                        equ 0002h
CWG1DBF_DBF2_POSN                        equ 0002h
CWG1DBF_DBF2_POSITION                    equ 0002h
CWG1DBF_DBF2_SIZE                        equ 0001h
CWG1DBF_DBF2_LENGTH                      equ 0001h
CWG1DBF_DBF2_MASK                        equ 0004h
CWG1DBF_DBF3_POSN                        equ 0003h
CWG1DBF_DBF3_POSITION                    equ 0003h
CWG1DBF_DBF3_SIZE                        equ 0001h
CWG1DBF_DBF3_LENGTH                      equ 0001h
CWG1DBF_DBF3_MASK                        equ 0008h
CWG1DBF_DBF4_POSN                        equ 0004h
CWG1DBF_DBF4_POSITION                    equ 0004h
CWG1DBF_DBF4_SIZE                        equ 0001h
CWG1DBF_DBF4_LENGTH                      equ 0001h
CWG1DBF_DBF4_MASK                        equ 0010h
CWG1DBF_DBF5_POSN                        equ 0005h
CWG1DBF_DBF5_POSITION                    equ 0005h
CWG1DBF_DBF5_SIZE                        equ 0001h
CWG1DBF_DBF5_LENGTH                      equ 0001h
CWG1DBF_DBF5_MASK                        equ 0020h
CWG1DBF_CWG1DBF_POSN                     equ 0000h
CWG1DBF_CWG1DBF_POSITION                 equ 0000h
CWG1DBF_CWG1DBF_SIZE                     equ 0006h
CWG1DBF_CWG1DBF_LENGTH                   equ 0006h
CWG1DBF_CWG1DBF_MASK                     equ 003Fh
CWG1DBF_CWG1DBF0_POSN                    equ 0000h
CWG1DBF_CWG1DBF0_POSITION                equ 0000h
CWG1DBF_CWG1DBF0_SIZE                    equ 0001h
CWG1DBF_CWG1DBF0_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF0_MASK                    equ 0001h
CWG1DBF_CWG1DBF1_POSN                    equ 0001h
CWG1DBF_CWG1DBF1_POSITION                equ 0001h
CWG1DBF_CWG1DBF1_SIZE                    equ 0001h
CWG1DBF_CWG1DBF1_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF1_MASK                    equ 0002h
CWG1DBF_CWG1DBF2_POSN                    equ 0002h
CWG1DBF_CWG1DBF2_POSITION                equ 0002h
CWG1DBF_CWG1DBF2_SIZE                    equ 0001h
CWG1DBF_CWG1DBF2_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF2_MASK                    equ 0004h
CWG1DBF_CWG1DBF3_POSN                    equ 0003h
CWG1DBF_CWG1DBF3_POSITION                equ 0003h
CWG1DBF_CWG1DBF3_SIZE                    equ 0001h
CWG1DBF_CWG1DBF3_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF3_MASK                    equ 0008h
CWG1DBF_CWG1DBF4_POSN                    equ 0004h
CWG1DBF_CWG1DBF4_POSITION                equ 0004h
CWG1DBF_CWG1DBF4_SIZE                    equ 0001h
CWG1DBF_CWG1DBF4_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF4_MASK                    equ 0010h
CWG1DBF_CWG1DBF5_POSN                    equ 0005h
CWG1DBF_CWG1DBF5_POSITION                equ 0005h
CWG1DBF_CWG1DBF5_SIZE                    equ 0001h
CWG1DBF_CWG1DBF5_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF5_MASK                    equ 0020h

